{
    "gcp": [
        {
            "id": "",
            "body": [
                "Vertex AI model development tools"
            ],
            "answers": [
                "Training",
                "Experiments",
                "Metadata"
            ],
            "references": []
        },
        {
            "id": "",
            "body": [
                "Vertex AI deploy and use tools"
            ],
            "answers": [
                "Model Registry",
                "Endpoints",
                "Batch Predictions",
                "Matching Engine"
            ],
            "references": []
        },
        {
            "id": "",
            "body": [
                "Command to create a bucket"
            ],
            "answers": [
                "gsutil mb -l $REGION gs://{$BUCKET_NAME}"
            ],
            "references": []
        },
        {
            "id": "",
            "body": [
                "Command to get Project ID"
            ],
            "answers": [
                "gcloud config get-value project",
                "gcloud config get-value core/project",
                "gcloud info --format='value(config.project)'",
                "gcloud config list --format 'value(core.project)'"
            ],
            "references": []
        },
        {
            "id": "",
            "body": [
                "Hardware accelerator types 'accelerator_type'"
            ],
            "answers": [
                "ACCELERATOR_TYPE_UNSPECIFIED",
                "NVIDIA_TESLA_K80",
                "NVIDIA_TESLA_P100",
                "NVIDIA_TESLA_V100",
                "NVIDIA_TESLA_P4",
                "NVIDIA_TESLA_T4"
            ],
            "references": [
                "https://cloud.google.com/python/docs/reference/aiplatform/latest/google.cloud.aiplatform.CustomTrainingJob#google_cloud_aiplatform_CustomTrainingJob_run"
            ]
        },
        {
            "id": "",
            "body": [
                "Command to enable Vertex AI API in your project"
            ],
            "answers": [
                "gcloud --project PROJECT_ID services enable aiplatform.googleapis.com"
            ],
            "references": [
                "https://cloud.google.com/bigquery/docs/managing-models-vertex"
            ]
        },
        {
            "id": "",
            "body": [
                "Command to grant Vertex AI Model Registry permission to your service account."
            ],
            "answers": [
                "gcloud projects add-iam-policy-binding PROJECT_ID --member=serviceAccount:YOUR_SERVICE_ACCOUNT --role=roles/aiplatform.admin --condition=None"
            ],
            "references": [
                "https://cloud.google.com/bigquery/docs/managing-models-vertex"
            ]
        },
        {
            "id": "",
            "body": [
                "Command to grant Vertex AI Model Registry permission to your service account, if you are not owner of your project."
            ],
            "answers": [
                "gcloud projects add-iam-policy-binding PROJECT_ID --member=user:YOUR_GCLOUD_ACCOUNT --role=roles/aiplatform.admin --condition=None"
            ],
            "references": [
                "https://cloud.google.com/bigquery/docs/managing-models-vertex"
            ]
        }
    ],
    "handson-ml3": [
        {
            "id": "handson-ml3_1",
            "body": [
                "How would you define machine learning?"
            ],
            "answers": [
                "Machine Learning is about building systems that can learn from data. Learning means getting better at some task, given some performance measure."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_2",
            "body": [
                "Can you name four types of applications where it shines?"
            ],
            "answers": [
                "Machine Learning is great for:",
                [
                    "complex problems for which we have no algorithmic solution",
                    "to replace long lists of hand-tuned rules",
                    "to build systems that adapt to fluctuating environments",
                    "to help humans learn (e.g., data mining)."
                ]
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_3",
            "body": [
                "What is a labeled training set?"
            ],
            "answers": [
                "A labeled training set is a training set that contains the desired solution (a.k.a. a label) for each instance."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_4",
            "body": [
                "What are the two most common supervised tasks?"
            ],
            "answers": [
                "Regression and classification."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_5",
            "body": [
                "Can you name four common unsupervised tasks?"
            ],
            "answers": [
                [
                    "clustering",
                    "visualization",
                    "dimensionality reduction",
                    "association rule learning"
                ]
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_6",
            "body": [
                "What type of algorithm would you use to allow a robot to walk in various unknown terrains?"
            ],
            "answers": [
                "Reinforcement Learning is likely to perform best if we want a robot to learn to walk in various unknown terrains, since this is typically the type of problem that Reinforcement Learning tackles. It might be possible to express the problem as a supervised or semi-supervised learning problem, but it would be less natural."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_7",
            "body": [
                "What type of algorithm would you use to segment your customers into multiple groups?"
            ],
            "answers": [
                [
                    "If you don't know how to define the groups, then you can use a clustering algorithm (unsupervised learning) to segment your customers into clusters of similar customers.",
                    "If you know what groups you would like to have, then you can feed many examples of each group to a classification algorithm (supervised learning), and it will classify all your customers into these groups."
                ]
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_8",
            "body": [
                "Would you frame the problem of spam detection as a supervised learning problem or an unsupervised learning problem?"
            ],
            "answers": [
                "Spam detection is a typical supervised learning problem: the algorithm is fed many emails along with their labels (spam or not spam)."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_9",
            "body": [
                "What is an online learning system?"
            ],
            "answers": [
                "An online learning system can learn incrementally, as opposed to a batch learning system. This makes it capable of adapting rapidly to both changing data and autonomous systems, and of training on very large quantities of data."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_10",
            "body": [
                "What is out-of-core learning?"
            ],
            "answers": [
                "Out-of-core algorithms can handle vast quantities of data that cannot fit in a computer's main memory. An out-of-core learning algorithm chops the data into mini-batches and uses online learning techniques to learn from these mini-batches."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_11",
            "body": [
                "What type of algorithm relies on a similarity measure to make predictions?"
            ],
            "answers": [
                "An instance-based learning system learns the training data by heart; then, when given a new instance, it uses a similarity measure to find the most similar learned instances and uses them to make predictions."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_12",
            "body": [
                "What is the difference between a model parameter and a model hyperparameter?"
            ],
            "answers": [
                "A model has one or more model parameters that determine what it will predict given a new instance (e.g., the slope of a linear model). A learning algorithm tries to find optimal values for these parameters such that the model generalizes well to new instances. A hyperparameter is a parameter of the learning algorithm itself, not of the model (e.g., the amount of regularization to apply)."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_13",
            "body": [
                "What do model-based algorithms search for? What is the most common strategy they use to succeed? How do they make predictions?"
            ],
            "answers": [
                "Model-based learning algorithms search for an optimal value for the model parameters such that the model will generalize well to new instances. We usually train such systems by minimizing a cost function that measures how bad the system is at making predictions on the training data, plus a penalty for model complexity if the model is regularized. To make predictions, we feed the new instance's features into the model's prediction function, using the parameter values found by the learning algorithm."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_14",
            "body": [
                "Can you name four of the main challenges in machine learning?"
            ],
            "answers": [
                "Some of the main challenges in Machine Learning are:",
                [
                    "the lack of data",
                    "poor data quality",
                    "nonrepresentative data",
                    "uninformative features",
                    "excessively simple models that underfit the training data",
                    "excessively complex models that overfit the data"
                ]
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_15",
            "body": [
                "If your model performs great on the training data but generalizes poorly to new instances, what is happening? Can you name three possible solutions?"
            ],
            "answers": [
                "If a model performs great on the training data but generalizes poorly to new instances, the model is likely overfitting the training data. Possible solutions to overfitting are:",
                [
                    "getting more data",
                    "simplifying the model (selecting a simpler algorithm, reducing the number of parameters or features used, or regularizing the model)",
                    "reducing the noise in the training data."
                ]
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_16",
            "body": [
                "What is a test set, and why would you want to use it?"
            ],
            "answers": [
                "A test set is used to estimate the generalization error that a model will make on new instances, before the model is launched in production."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_17",
            "body": [
                "What is the purpose of a validation set?"
            ],
            "answers": [
                "A validation set is used to compare models. It makes it possible to select the best model and tune the hyperparameters."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_18",
            "body": [
                "What is the train-dev set, when do you need it, and how do you use it?"
            ],
            "answers": [
                "The train-dev set is used when there is a risk of mismatch between the training data and the data used in the validation and test datasets (which should always be as close as possible to the data used once the model is in production). The train-dev set is a part of the training set that's held out (the model is not trained on it). The model is trained on the rest of the training set, and evaluated on both the train-dev set and the validation set. If the model performs well on the training set but not on the train-dev set, then the model is likely overfitting the training set. If it performs well on both the training set and the train-dev set, but not on the validation set, then there is probably a significant data mismatch between the training data and the validation + test data, and you should try to improve the training data to make it look more like the validation + test data."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        },
        {
            "id": "handson-ml3_19",
            "body": [
                "What can go wrong if you tune hyperparameters using the test set?"
            ],
            "answers": [
                "If you tune hyperparameters using the test set, you risk overfitting the test set, and the generalization error you measure will be optimistic (you may launch a model that performs worse than you expect)."
            ],
            "references": ["Hands-on Machine Learning with Scikit-Learn, Keras and TensorFlow (3rd edition)"]
        }
    ]
}